import React from 'react'
import Post from './post/Post'

import { PostProps } from '@/type/Post';

export default function Posts() {
 

  const posts:PostProps[]=[
    {id:1,textLines:" الأول بالرّد المتّبعة حيث لم. أضف بلاده بريطانيا-فرنسا إذ, من جهة بقسوة الأول بالرّد المتّبعة حيث لم. أضف بلاده بريطانيا-فرنسا إذ, من جهة بقسوة الأول بالرّد المتّبعة حيث لم. أضف بلاده بريطانيا-فرنسا إذ, من جهة بقسوة الأول بالرّد المتّبعة حيث لم. أضف بلاده بريطانيا-فرنسا إذ, من جهة بقسوة الأول بالرّد المتّبعة حيث لم. أضف بلاده بريطانيا-فرنسا إذ, من جهة بقسوةيي جدول الحكم أخر بل, أم لفرنسا والكساد عرض. دون إبّان وتنصيب أي, على الأول بالرّد المتّبعة حيث لم. أضف بلاده بريطانيا-فرنسا إذ, من جهة بقسوة الأول بالرّد المتّبعة حيث لم. أضف بلاده بريطانيا-فرنسا إذ, من جهة بقسوة الأول بالرّد المتّبعة حيث لم. أضف بلاده بريطانيا-فرنسا إذ, من جهة بقسوة الأول بالرّد المتّبعة حيث لم. أضف بلاده بريطانيا-فرنسا إذ, من جهة بقسوة الأول بالرّد المتّبعة حيث لم. أضف بلاده بريطانيا-فرنسا إذ, من جهة بقسوة الأول بالرّد المتّبعة حيث لم. أضف بلاده بريطانيا-فرنسا إذ, من جهة بقسوة الأول بالرّد المتّبعة حيث لم. أضف بلاده بريطانيا-فرنسا إذ, من جهة بقسوة الأول بالرّد المتّبعة حيث لم. أضف بلاده بريطانيا-فرنسا إذ, من جهة بقسوة الأول بالرّد المتّبعة حيث لم. أضف بلاده بريطانيا-فرنسا إذ, من جهة بقسوة الأول بالرّد المتّبعة حيث لم. أضف بلاده بريطانيا-فرنسا إذ, من جهة بقسوة الأول بالرّد المتّبعة حيث لم. أضف بلاده بريطانيا-فرنسا إذ, من جهة بقسوة الأول بالرّد المتّبعة حيث لم. أضف بلاده بريطانيا-فرنسا إذ, من جهة بقسوةالأول بالرّد المتّبعة حيث لم. أضف بلاده بريطانيا-فرنسا إذ, من جهة بقسوة الأول بالرّد المتّبعة حيث لم. أضف بلاده بريطانيا-فرنسا إذ, من جهة بقسوة الأول بالرّد المتّبعة حيث لم. أضف بلاده بريطانيا-فرنسا إذ, من جهة بقسوة الأول بالرّد المتّبعة حيث لم. أضف بلاده بريطانيا-فرنسا إذ, من جهة بقسوة الأول بالرّد المتّبعة حيث لم. أضف بلاده بريطانيا-فرنسا إذ, من جهة بقسوة الأول بالرّد المتّبعة حيث لم. أضف بلاده بريطانيا-فرنسا إذ, من جهة بقسوة هو وحتّى اليميني. شمال والحزب الأمريكية أي جهة, لم ببعض اليها الإثنان أخر. فعل غريمه الجنوب الأوروبية ان, ثم وفي تشكيل وانهاء الربيع،, الأول بالرّد المتّبعة حيث لم. أضف بلاده بريطانيا-فرنسا إذ, من جهة بقسوة سليمان،.",title:"كيف توقفت عن التدخين بعد 8 سنوات ادمان", date:"2024/10/16", profilePicture:"",tag:"إدمان", category:"تحفيز"}
  ]
  return (
    <section>
        <Post post={posts[0]}/>
        <Post post={posts[0]} />
        <Post post={posts[0]}/>
        <Post post={posts[0]}/>
        
			</section>
  )
}
